In [2]:
import pandas as pd
import numpy as np
data=pd.read_csv('Test.csv')

In [4]:
df=data.copy()
df

   S.No.    Name  Class  Roll
0      1  Nikhil      9    50
1      2     Abc      9    49
2      3     Def      9    58
3      4     Ghi      9    47

In [15]:
df.iloc[2:4,1:2]=np.nan
print(df)
df.Name.fillna('Abc',inplace=True)
#(df.sw.mean())
df

   S.No.    Name  Class  Roll
0      1  Nikhil      9    50
1      2     Abc      9    49
2      3     NaN      9    58
3      4     NaN      9    47

   S.No.    Name  Class  Roll
0      1  Nikhil      9    50
1      2     Abc      9    49
2      3     Abc      9    58
3      4     Abc      9    47

In [ ]:

def f(s):
    if(s=="Male"):
        return 0
    else:
        return 1
#df["n"]=  df.Gender.apply(f)